app/controllers/api/posts_controller.rb

    def create
        @post = Post.new(post_params)
        if @post.save
---
INSERT INTO "posts" ("body", "channel_id", "author_id", "parent_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "asdgadf"], ["channel_id", 1], ["author_id", 1], ["parent_id", 1], ["created_at", "2021-08-04 23:27:09.188343"], ["updated_at", "2021-08-04 23:27:09.188343"]]