app/channels/chat_channel.rb

INSERT INTO "posts" ("body", "channel_id", "author_id", "parent_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "hello"], ["channel_id", 1], ["author_id", 2], ["parent_id", 1], ["created_at", "2021-08-05 00:25:54.828820"], ["updated_at", "2021-08-05 00:25:54.828820"]]
---
  def speak(data)
    post = Post.create(data['post'])