app/models/user.rb

    def password=(password)
        @password = password
        self.password_digest = BCrypt::Password.create(password)
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "9IBio204UR-mlofBX-2Tcw"], ["updated_at", "2021-08-04 05:20:16.435856"], ["id", 2]]